tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jez/formulae"
tap "romkatv/powerlevel10k"
tap "sachaos/todoist"
tap "sdkman/tap"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Shell extension to jump to frequently used directories
brew "autojump"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Encode and decode base64 files
brew "base64"
# Implementation of the DNS protocols
brew "bind"
# GNU binary tools for native development
brew "binutils"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Collection of portable C++ source libraries
brew "boost"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Classic UNIX line editor
brew "ed"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# GNU Emacs text editor
brew "emacs"
# Modern replacement for 'ls'
brew "exa"
# Program that can automate interactive applications
brew "expect"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Image loading and rendering library
brew "imlib2"
# X11 image viewer
brew "feh"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Submit git branches to gerrit for review
brew "git-review"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Apply a diff file to an original
brew "gpatch"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Make JSON greppable
brew "gron"
# SDK for Groovy: a Java-based scripting language
brew "groovysdk"
# Like cURL, but for gRPC
brew "grpcurl"
# Popular GNU data compression program
brew "gzip"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Instant coding answers via the command-line
brew "howdoi"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Open-source distributed event streaming platform
brew "kafka"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Library to Access SMI MIB Information
brew "libsmi"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Text-based web browser
brew "lynx"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Utility for directing compilation
brew "make"
# Text-to-HTML conversion tool
brew "markdown"
# Java-based project management
brew "maven"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube"
# Cross platform, open source .NET development framework
brew "mono"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client@5.7"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Command-line collection runner for Postman
brew "newman"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk@17"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql@14"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# File browser
brew "ranger"
# RC file (dotfile) management
brew "rcm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Standard unix software packaging tool
brew "rpm"
# Tool to convert RPM package to CPIO archive
brew "rpm2cpio", link: false
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# JVM-based programming language
brew "scala@2.12"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Source-code syntax highlighter
brew "source-highlight"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Process Control System
brew "supervisor"
# Feature-rich console based todo list manager
brew "task"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Dungeon modified from FORTRAN to C
brew "zork"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Heatmap of oft-edited files
brew "jez/formulae/git-heatmap"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Sdkman - The Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# Menu bar weather app
cask "datweatherdoe"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Screen color temperature controller
cask "flux"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
